# WoodRayNumSlices Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodRayNumSlices Property
AdvancedWood Class See Also
---
The property labeled "Number of slices in xy plane" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodRayNumSlices { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodRayNumSlices As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodRayNumSlices {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger".
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace